Repository: jm-fukuda/ateji_T-shirt_project
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ja, th

source: The entered name contains an inappropriate word and cannot be used.
ja: 入力された名前には不適切な語句が含まれているため使用できません。

source: Kanji Ateji Generator
ja: 漢字当て字ジェネレーター
th: เครื่องสร้างคันจิอาเทจิ

source: Shop Logo
ja: ショップロゴ
th: โลโก้ร้านค้า

source: New Search
ja: 新しい検索
th: ค้นหาใหม่

source: Close
ja: 閉じる
th: ปิด

source: Name
ja: 名前
th: ชื่อ

source: Number of Candidates
ja: 候補数
th: จำนวนตัวเลือก

source: 3 (Default)
ja: 3（デフォルト）
th: 3 (ค่าเริ่มต้น)

source: Display Mode
ja: 表示モード
th: โหมดการแสดงผล

source: Horizontal
ja: 横書き
th: แนวนอน

source: Vertical
ja: 縦書き
th: แนวตั้ง

source: Font
ja: フォント
th: แบบอักษร

source: Convert
ja: 変換
th: แปลง

source: (Loaded from database)
ja: （データベースから取得）
th: (โหลดจากฐานข้อมูล)

source: (Generated by AI)
ja: （AIで生成）
th: (สร้างโดย AI)

source: You can right-click the Kanji image to copy or save it.
ja: 漢字画像を右クリックしてコピーまたは保存できます。
th: คุณสามารถคลิกขวาที่ภาพคันจิเพื่อคัดลอกหรือบันทึกได้

source: Confirm T-Shirt Design
ja: Tシャツデザイン確認
th: ยืนยันการออกแบบเสื้อยืด

source: Confirm Your T-Shirt Design
ja: Tシャツデザインをご確認ください
th: ยืนยันการออกแบบเสื้อยืดของคุณ

source: T-shirt Size
ja: Tシャツサイズ
th: ขนาดเสื้อยืด

source: Body Color
ja: ボディカラー
th: สีเสื้อ

source: Print Color
ja: プリントカラー
th: สีพิมพ์

source: Price: <strong>¥%(price)s</strong> <span class="fs-6">(tax included)</span>
ja: 価格：<strong>¥%(price)s</strong> <span class="fs-6">（税込）</span>
th: ราคา: <strong>¥%(price)s</strong> <span class="fs-6">(รวมภาษี)</span>

source: Yes, make a T-shirt with this Kanji!
ja: この漢字でTシャツを作成する
th: ใช่, สร้างเสื้อยืดด้วยคันจินี้!

source: Cancel
ja: キャンセル
th: ยกเลิก

source: Order Details
ja: 注文詳細
th: รายละเอียดคำสั่งซื้อ

source: Thank you for your order!
ja: ご注文ありがとうございます！
th: ขอบคุณสำหรับการสั่งซื้อของคุณ!

source: Order No. %(order_no)s
ja: 注文番号：%(order_no)s
th: หมายเลขคำสั่งซื้อ: %(order_no)s

source: Please take a screenshot of this page and show it to the cashier if needed.
ja: このページのスクリーンショットを撮影し、必要に応じてレジでご提示ください。
th: กรุณาถ่ายภาพหน้าจอนี้และแสดงต่อพนักงานเคาน์เตอร์หากจำเป็น

source: Please save a screenshot of this page.
ja: このページのスクリーンショットを保存してください。
th: กรุณาบันทึกภาพหน้าจอนี้

source: JAN Code
ja: JANコード
th: รหัส JAN

source: QR Code
ja: QRコード
th: คิวอาร์โค้ด

source: Kanji:
ja: 漢字：
th: คันจิ:

source: Reading:
ja: 読み：
th: การอ่าน:

source: Meaning:
ja: 意味：
th: ความหมาย:

source: Font:
ja: フォント：
th: แบบอักษร:

source: Print Mode:
ja: 印刷モード：
th: โหมดพิมพ์:

source: Size:
ja: サイズ：
th: ขนาด:

source: Body Color:
ja: ボディカラー：
th: สีเสื้อ:

source: Print Color:
ja: プリントカラー：
th: สีพิมพ์:

source: Price:
ja: 価格：
th: ราคา:

source: <strong>¥%(price)s</strong> (%(_("tax included"))s)
ja: <strong>¥%(price)s</strong>（税込）
th: <strong>¥%(price)s</strong> (รวมภาษี)

source: Date:
ja: 日付：
th: วันที่:

source: Back to Top
ja: トップに戻る
th: กลับไปด้านบน

source: Asia/second
ja: 亜／第二
th: เอเชีย/ที่สอง

source: next to
ja: 隣
th: ถัดจาก

source: sorrow
ja: 悲しみ
th: ความเศร้า

source: love
ja: 愛
th: ความรัก

source: meet
ja: 会う
th: พบ

source: mallow/hollyhock
ja: 葵
th: ชบา/ฮอลลี่ฮ็อก

source: rising sun
ja: 旭（日出ずる）
th: พระอาทิตย์ขึ้น

source: reed
ja: 葦
th: ต้นกก

source: silk/twill
ja: 絹／綾
th: ผ้าไหม/ผ้าทอลายแนวทแยง

source: peace
ja: 平和
th: สันติภาพ

source: hermitage
ja: 庵
th: สำนักฤาษี/ที่พักสงบ

source: press/guide
ja: 押す／案内
th: กด/แนะนำ

source: dark
ja: 暗い
th: มืด

source: plan
ja: 計画
th: แผน

source: apricot
ja: 杏
th: แอปริคอต

source: by means of
ja: 以て
th: โดยวิธี

source: Italy/that one
ja: 伊／あれ
th: อิตาลี/อันนั้น

source: rank
ja: 位
th: ยศ/ตำแหน่ง

source: rely/depend
ja: 依存
th: พึ่งพา/ขึ้นอยู่กับ

source: great
ja: 偉大
th: ยอดเยี่ยม

source: majesty
ja: 威厳
th: ความสง่างาม

source: power
ja: 力
th: พลัง

source: will/meaning
ja: 意志／意味
th: เจตจำนง/ความหมาย

source: do
ja: 為す
th: ทำ

source: maintain
ja: 維持
th: รักษา/คงไว้

source: latitude/weave
ja: 緯度／織る
th: ละติจูด/ทอ

source: clothes
ja: 衣服
th: เสื้อผ้า

source: medicine
ja: 医
th: ยา/แพทยศาสตร์

source: outstanding
ja: 優秀
th: โดดเด่น

source: feather/wing
ja: 羽
th: ขน/ปีก

source: rain
ja: 雨
th: ฝน

source: seashore
ja: 浜
th: ชายฝั่ง

source: wisdom
ja: 知恵
th: สติปัญญา

source: reflect
ja: 映す／反射
th: สะท้อน

source: shine
ja: 輝き
th: เปล่งประกาย

source: glory/prosperity
ja: 栄光／繁栄
th: ความรุ่งเรือง/เกียรติยศ

source: eternity
ja: 永遠
th: นิรันดร

source: leak
ja: 漏れ
th: รั่วไหล

source: sparkling gem
ja: 瑠璃（きらめく宝石）
th: อัญมณีระยิบระยับ

source: excellent/hero
ja: 優／英雄
th: ยอดเยี่ยม/วีรบุรุษ

source: defend/protect
ja: 衛る/守る
th: ปกป้อง

source: recite (poem)
ja: 詠む（詩を）
th: ท่อง/เทศน์(บทกวี)

source: joy
ja: 喜び
th: ความสุข

source: circle
ja: 円
th: วงกลม

source: garden
ja: 園
th: สวน

source: banquet
ja: 宴
th: งานเลี้ยง

source: smoke
ja: 煙
th: ควัน

source: connection/fate
ja: 縁
th: โชคชะตา/ความเกี่ยวข้อง

source: far
ja: 遠い
th: ไกล

source: at
ja: 於
th: ที่

source: center
ja: 央/中心
th: ศูนย์กลาง

source: respond
ja: 応じる
th: ตอบสนอง

source: flourish
ja: 栄える
th: เจริญรุ่งเรือง

source: Europe
ja: 欧州
th: ยุโรป

source: king
ja: 王
th: กษัตริย์

source: seagull
ja: 鴎
th: นกนางนวล

source: yellow
ja: 黄
th: สีเหลือง

source: second
ja: 乙／第二
th: ที่สอง

source: grace
ja: 恩恵
th: ความสง่างาม

source: warm
ja: 温かい
th: อบอุ่น

source: calm
ja: 穏やか
th: สงบ

source: sound
ja: 音
th: เสียง

source: change
ja: 変化
th: เปลี่ยนแปลง

source: excellent/beautiful
ja: 佳い/美しい
th: เยี่ยมยอด/สวยงาม

source: add
ja: 加える
th: เพิ่ม

source: possible
ja: 可能
th: เป็นไปได้

source: excellent/congratulate
ja: 嘉/祝う
th: ดีเยี่ยม/ยินดีด้วย

source: house
ja: 家
th: บ้าน

source: department/branch
ja: 科/部門
th: แผนก/สาขา

source: fruit
ja: 果実
th: ผลไม้

source: song
ja: 歌
th: เพลง

source: river
ja: 川
th: แม่น้ำ

source: fire
ja: 火
th: ไฟ

source: flower
ja: 花
th: ดอกไม้

source: load
ja: 荷
th: บรรทุก/น้ำหนัก

source: splendor
ja: 華麗
th: ความโอ่อ่า

source: Buddhism-related (Ka)
ja: 仏教用語「迦」
th: เกี่ยวกับพุทธศาสนา (กะ)

source: picture
ja: 絵
th: ภาพ

source: bud
ja: 芽
th: หน่อ/ตาใบ

source: congratulate
ja: 賀（祝う）
th: แสดงความยินดี

source: elegant
ja: 雅
th: สง่างาม

source: pleasant
ja: 快い
th: น่ารื่นรมย์

source: painting
ja: 画
th: ภาพวาด

source: divide
ja: 割る/区分
th: แบ่ง

source: music/comfort
ja: 楽/快適
th: ดนตรี/ปลอบใจ

source: grant
ja: 許可/与える
th: ให้/อนุญาต

source: crown
ja: 冠
th: มงกุฎ

source: sweet
ja: 甘い
th: หวาน

source: between
ja: 間
th: ระหว่าง

source: shore
ja: 岸
th: ชายฝั่ง

source: eye
ja: 目
th: ตา

source: rock
ja: 岩
th: หิน

source: face
ja: 顔
th: ใบหน้า

source: wish
ja: 願い
th: ปรารถนา

source: container
ja: 器
th: ภาชนะ

source: foundation
ja: 基礎
th: รากฐาน

source: hope
ja: 希望
th: ความหวัง

source: spirit
ja: 精神
th: จิตวิญญาณ

source: pray
ja: 祈る
th: สวดภาวนา

source: chronicle
ja: 年代記
th: พงศาวดาร/บันทึกเหตุการณ์

source: ceremony
ja: 儀式
th: พิธี

source: good/fit
ja: 良い／適合
th: ดี/เหมาะสม

source: justice/righteousness
ja: 正義／義
th: ความยุติธรรม/ความชอบธรรม

source: eternity/long time
ja: 永遠／長い間
th: นิรันดร/เวลานาน

source: bridge
ja: 橋
th: สะพาน

source: gold
ja: 金
th: ทอง

source: nine
ja: 九
th: เก้า

source: phrase
ja: 句
th: วลี/ถ้อยคำ

source: beautiful black stone
ja: 美しい黒石
th: อัญมณีดำที่สวยงาม

source: suffer
ja: 苦しむ
th: ทรมาน

source: tool/possess
ja: 道具/持つ
th: เครื่องมือ/ครอบครอง

source: foolish
ja: 愚か
th: โง่

source: sky/empty
ja: 空／空っぽ
th: ท้องฟ้า/ว่างเปล่า

source: chestnut
ja: 栗
th: เกาลัด

source: blessing
ja: 祝福
th: พร

source: wise
ja: 賢い
th: ฉลาด

source: moon
ja: 月
th: พระจันทร์

source: origin
ja: 起源
th: ต้นกำเนิด

source: mysterious
ja: 神秘的
th: ลึกลับ

source: old
ja: 古い
th: เก่า

source: self
ja: 自分
th: ตัวเอง

source: door
ja: ドア
th: ประตู

source: drum
ja: 太鼓
th: กลอง

source: Chinese parasol tree
ja: 鳳凰木
th: ต้นหวงหยาง (ต้นทอง)

source: light
ja: 光
th: แสง

source: public/duke
ja: 公共／公爵
th: สาธารณะ/ดยุก

source: crimson/red
ja: 真紅／赤
th: สีแดงเข้ม/แดง

source: fragrance
ja: 香り
th: กลิ่นหอม

source: strong
ja: 強い
th: แข็งแรง

source: now
ja: 今
th: ตอนนี้

source: descendant
ja: 子孫
th: ลูกหลาน

source: root
ja: 根
th: ราก

source: mix
ja: 混ぜる
th: ผสม

source: navy blue
ja: 紺色
th: สีน้ำเงินกรมท่า

source: soul
ja: 魂
th: จิตวิญญาณ

source: help
ja: 助ける
th: ช่วยเหลือ

source: left
ja: 左
th: ซ้าย

source: sand
ja: 砂
th: ทราย

source: seat
ja: 席
th: ที่นั่ง

source: color
ja: 色
th: สี

source: talent
ja: 才能
th: พรสวรรค์

source: greens/vegetable
ja: 野菜
th: ผัก

source: judge/decision
ja: 判定/決定
th: ผู้ตัดสิน/การตัดสิน

source: bloom
ja: 咲く
th: เบ่งบาน

source: make
ja: 作る
th: สร้าง

source: cherry blossom
ja: 桜
th: ซากุระ

source: three
ja: 三
th: สาม

source: mountain
ja: 山
th: ภูเขา

source: scatter
ja: 散る
th: กระจาย

source: manage
ja: 管理する
th: จัดการ

source: child
ja: 子供
th: เด็ก

source: city/market
ja: 町／市場
th: เมือง/ตลาด

source: will/ambition
ja: 意志／野心
th: ความมุ่งมั่น/ความทะเยอทะยาน

source: branch
ja: 枝
th: กิ่งไม้/สาขา

source: purple
ja: 紫
th: สีม่วง

source: poetry
ja: 詩
th: กลอน/บทกวี

source: resemble
ja: 似ている
th: คล้ายกับ

source: mercy
ja: 慈悲
th: เมตตา

source: hold
ja: 持つ
th: ถือ

source: time
ja: 時
th: เวลา

source: next
ja: 次
th: ถัดไป

source: govern
ja: 治める
th: ปกครอง

source: magnet
ja: 磁石
th: แม่เหล็ก

source: truth/fruit
ja: 真実／果実
th: ความจริง/ผลไม้

source: shrine/company
ja: 神社／会社
th: ศาลเจ้า/บริษัท

source: gauze
ja: ガーゼ
th: ผ้าก๊อซ

source: person
ja: 人
th: บุคคล

source: snake
ja: 蛇
th: งู

source: wicked
ja: 邪悪
th: ชั่วร้าย

source: scale/measure
ja: 目盛り／計る
th: มาตราส่วน/วัด

source: noble
ja: 高貴
th: มีเกียรติ/สูงศักดิ์

source: young
ja: 若い
th: เด็ก/อ่อนเยาว์

source: weak
ja: 弱い
th: อ่อนแอ

source: master
ja: 主人
th: เจ้า/อาจารย์

source: protect
ja: 守る
th: ปกป้อง

source: vermillion
ja: 朱色
th: สีชาด

source: pearl
ja: 真珠
th: ไข่มุก

source: spell/curse
ja: 呪文／呪い
th: เวทมนตร์/คำสาป

source: longevity/congratulations
ja: 長寿/祝賀
th: อายุยืน/คำอวยพร

source: tree
ja: 木
th: ต้นไม้

source: around
ja: 周り
th: รอบๆ

source: sect/religion
ja: 宗派／宗教
th: นิกาย/ศาสนา

source: continent/island/state
ja: 大陸／島／州
th: ทวีป/เกาะ/รัฐ

source: learn/repair
ja: 学ぶ／修理
th: เรียนรู้/ซ่อมแซม

source: sandbank/island
ja: 砂州／島
th: สันทราย/เกาะ

source: excellent
ja: 優秀
th: ยอดเยี่ยม

source: autumn
ja: 秋
th: ฤดูใบไม้ร่วง

source: end
ja: 終わり
th: จบ

source: boat
ja: 船
th: เรือ

source: gather
ja: 集める
th: รวบรวม

source: ten
ja: 十
th: สิบ

source: appear/out/exit
ja: 現れる／出る
th: ปรากฏ/ออก/ทางออก

source: spring
ja: 春
th: ฤดูใบไม้ผลิ

source: beginning/thread
ja: 始まり／糸
th: จุดเริ่มต้น/ด้าย

source: describe
ja: 描写する
th: บรรยาย

source: smile
ja: 微笑み
th: รอยยิ้ม

source: height/ten feet
ja: 高さ／十尺
th: ความสูง/สิบฟุต

source: ride
ja: 乗る
th: ขี่

source: castle
ja: 城
th: ปราสาท

source: place
ja: 場所
th: สถานที่

source: usual/constant
ja: 通常／一定
th: ปกติ/สม่ำเสมอ

source: emotion
ja: 感情
th: อารมณ์

source: article/clause
ja: 記事／条項
th: บทความ/ข้อ

source: pure
ja: 純粋
th: บริสุทธิ์

source: bountiful
ja: 豊かな
th: อุดมสมบูรณ์

source: yield
ja: 収穫
th: ผลผลิต

source: weave
ja: 織る
th: ทอ

source: new
ja: 新しい
th: ใหม่

source: true
ja: 真実
th: จริง

source: truth
ja: 真理
th: ความจริง

source: god
ja: 神
th: พระเจ้า

source: benevolence
ja: 仁
th: เมตตาธรรม

source: must/necessary
ja: 必要
th: ต้อง/จำเป็น

source: pure/elegance
ja: 清らか／優雅
th: บริสุทธิ์/ความสง่างาม

source: auspicious
ja: 吉兆
th: เป็นมงคล

source: sparrow
ja: 雀
th: นกกระจอก

source: clear
ja: 清い／明るい
th: ใส/ชัดเจน

source: world
ja: 世界
th: โลก

source: rapids
ja: 急流
th: แก่งน้ำ

source: right/this
ja: 右／これ
th: ขวา/นี้

source: energy
ja: エネルギー
th: พลังงาน

source: force
ja: 力
th: พลัง

source: conquer
ja: 征服する
th: พิชิต

source: become
ja: なる
th: กลายเป็น

source: sunny/clear
ja: 晴れた／明るい
th: สดใส/แจ่มใส

source: nest
ja: 巣
th: รัง

source: life
ja: 命／人生
th: ชีวิต

source: holy
ja: 聖なる
th: ศักดิ์สิทธิ์

source: blue/gree
ja: 青／緑
th: น้ำเงิน/เขียว

source: quiet
ja: 静か
th: เงียบ

source: regret
ja: 後悔
th: เสียใจ

source: fold/break
ja: 折る／壊す
th: พับ/หัก

source: thousand
ja: 千
th: หนึ่งพัน

source: goodness
ja: 善
th: ความดี

source: thus
ja: このように
th: ดังนั้น

source: once/former
ja: かつての／昔の
th: ครั้งหนึ่ง/เดิม

source: refined
ja: 洗練された
th: ประณีต/ขัดเกลา

source: ancestor
ja: 祖先
th: บรรพบุรุษ

source: element/pure/plain
ja: 元素／純／質素
th: ธาตุ/บริสุทธิ์/เรียบง่าย

source: revive
ja: 復活する
th: ฟื้นฟู

source: play (music)
ja: 演奏する（音楽）
th: เล่น (ดนตรี)

source: early
ja: 早い
th: เช้า/ต้น

source: grass
ja: 草
th: หญ้า

source: blue/green
ja: 青／緑
th: น้ำเงิน/เขียว

source: storehouse
ja: 倉庫
th: โกดัง/คลัง

source: grandchild/descendant
ja: 孫／子孫
th: หลาน/ลูกหลาน

source: respect
ja: 尊敬
th: เคารพ

source: village
ja: 村
th: หมู่บ้าน

source: humble
ja: 謙虚
th: ถ่อมตน

source: many
ja: 多い
th: หลาย

source: thick
ja: 厚い
th: หนา

source: steep slope
ja: 急な坂
th: ทางลาดชัน

source: load/packhorse
ja: 荷物／荷馬
th: บรรทุก/ม้าใช้บรรทุก

source: era/replace
ja: 時代／交代
th: ยุค/แทนที่

source: platform
ja: 台
th: ชานชาลา/เวที

source: big
ja: 大きい
th: ใหญ่

source: title
ja: 称号／タイトル
th: ตำแหน่ง/ชื่อเรื่อง

source: valley
ja: 谷
th: หุบเขา

source: morning
ja: 朝
th: เช้า

source: light/pale
ja: 薄い／淡い
th: อ่อน/สว่าง

source: edge
ja: 端
th: ขอบ

source: group
ja: 集団
th: กลุ่ม

source: platform/altar
ja: 壇
th: แท่น/แท่นบูชา

source: bullet/play
ja: 弾丸／遊ぶ
th: กระสุน/เล่น

source: sandalwood
ja: 白檀（ビャクダン）
th: จันทน์หอม

source: step
ja: 歩／段階
th: ก้าว/ขั้นตอน

source: man
ja: 男
th: ผู้ชาย

source: earth
ja: 地球／土
th: โลก/พื้นดิน

source: harbor
ja: 港
th: ท่าเรือ

source: decide/fixed
ja: 決定／固定
th: ตัดสินใจ/คงที่

source: settled
ja: 解決済み
th: ถูกจัดการ/ตั้งรกราก

source: emperor
ja: 天皇
th: จักรพรรดิ

source: bottom
ja: 底
th: ด้านล่าง

source: code/ceremony
ja: コード／儀礼
th: รหัส/พิธีกรรม

source: sky/heaven
ja: 空／天
th: ท้องฟ้า/สวรรค์

source: point/dot
ja: 点
th: จุด

source: transmit
ja: 伝える
th: ถ่ายทอด/ส่งต่อ

source: palace
ja: 宮殿
th: พระราชวัง

source: sediment
ja: 沈殿／堆積物
th: ตะกอน

source: field
ja: 畑／分野
th: ทุ่ง/สนาม

source: electricity
ja: 電気
th: ไฟฟ้า

source: follower
ja: 従者
th: ผู้ติดตาม

source: Big Dipper/measure
ja: 北斗七星／尺度
th: กลุ่มดาวจระเข้/มาตราวัด

source: cross
ja: 横切る／交差
th: ข้าม

source: climb
ja: 登る
th: ปีน

source: way/route
ja: 道／ルート
th: เส้นทาง

source: metropolis/capital city
ja: 大都市／首都
th: มหานคร/เมืองหลวง

source: degree
ja: 度
th: ระดับ

source: equal
ja: 等しい
th: เท่ากัน

source: head
ja: 頭
th: หัว

source: way
ja: 道
th: ทาง

source: gain
ja: 得る
th: ได้รับ

source: Nara/what
ja: 奈良／何
th: นารา/อะไร

source: what/beautiful
ja: 何／美しい
th: อะไร/สวยงาม

source: south
ja: 南
th: ทิศใต้

source: two
ja: 二
th: สอง

source: sun
ja: 太陽
th: พระอาทิตย์

source: enter
ja: 入る
th: เข้า

source: like/as
ja: ～のような
th: เหมือน/เช่น

source: peaceful
ja: 平和な
th: สงบ

source: from/of
ja: 〜から／の
th: จาก/ของ

source: deep/rich
ja: 深い／豊か
th: ลึก/ร่ำรวย

source: ability
ja: 能力
th: ความสามารถ

source: farming
ja: 農業
th: เกษตรกรรม

source: supremacy
ja: 覇権
th: ความเป็นใหญ่

source: wave
ja: 波
th: คลื่น

source: faction
ja: 派閥
th: กลุ่ม/ฝ่าย

source: banana (芭蕉)
ja: バショウ（芭蕉）
th: กล้วย (芭蕉)

source: horse
ja: 馬
th: ม้า

source: back
ja: 背中
th: หลัง

source: eight
ja: 八
th: แปด

source: princess
ja: 姫
th: เจ้าหญิง

source: ornate/patterned
ja: 華やか／模様
th: ประดับตกแต่ง/มีลวดลาย

source: scarlet
ja: 緋色
th: สีแดงสด

source: prepare
ja: 準備する
th: เตรียม

source: subtle
ja: 微妙
th: ละเอียดอ่อน

source: tiny/subtle
ja: 小さい／微細
th: เล็ก/ละเอียดอ่อน

source: help/protect
ja: 助ける/守る
th: ช่วยเหลือ/ปกป้อง

source: biwa (lute)
ja: 琵琶
th: บิวะ (ขลุ่ยญี่ปุ่น)

source: eyebrow
ja: 眉
th: คิ้ว

source: beautiful
ja: 美しい
th: งดงาม

source: agile
ja: 敏捷
th: ว่องไว

source: not
ja: ～ではない
th: ไม่ใช่

source: wealth
ja: 富
th: ความมั่งคั่ง

source: cloth
ja: 布
th: ผ้า

source: warrior
ja: 武士／戦士
th: นักรบ

source: dance
ja: 踊る
th: เต้นรำ

source: department/part
ja: 部門／部分
th: แผนก/ส่วน

source: wind
ja: 風
th: ลม

source: flat/peace
ja: 平ら／平和
th: เรียบ/สันติ

source: rice
ja: 米
th: ข้าว

source: jade/blue-green
ja: 翡翠／青緑
th: หยก/สีฟ้าเขียว

source: partial
ja: 部分的
th: บางส่วน

source: one-side
ja: 片側
th: ด้านเดียว

source: compile/knit
ja: 編集／編む
th: รวบรวม/ถัก

source: edge/border
ja: 端／境界
th: ขอบ/ชายแดน

source: return
ja: 戻る
th: คืน

source: everywhere
ja: どこでも
th: ทุกที่

source: convenience
ja: 便利
th: สะดวก

source: endeavor
ja: 努力
th: ความพยายาม

source: speech/discernment
ja: 話す／識別
th: คำพูด/การจำแนก

source: walk
ja: 歩く
th: เดิน

source: twilight/evening
ja: 夕暮れ／夕方
th: พลบค่ำ/ตอนเย็น

source: friend/companion
ja: 友／仲間
th: เพื่อน/สหาย

source: phoenix
ja: 鳳凰
th: นกฟีนิกซ์

source: hope/wish
ja: 希望／願い
th: ความหวัง/ความปรารถนา

source: rub/polish
ja: 磨く
th: ถู/ขัด

source: polish
ja: 磨く
th: ขัด

source: magic
ja: 魔法
th: เวทมนตร์

source: hemp
ja: 麻
th: กัญชา

source: counter for flat things
ja: 枚（平物の助数詞）
th: ตัวนับสำหรับวัตถุแบน

source: every
ja: すべて
th: ทุกๆ

source: ten thousand
ja: 一万
th: หนึ่งหมื่น

source: full
ja: 満ちた
th: เต็ม

source: not yet/future
ja: 未／未来
th: ยังไม่/อนาคต

source: charm
ja: 魅力／まじない
th: เสน่ห์/เครื่องราง

source: snake (zodiac)
ja: 巳（干支の蛇）
th: งู (นักษัตร)

source: people
ja: 人々
th: ผู้คน

source: work/effort
ja: 働く／努力
th: งาน/ความพยายาม

source: dream
ja: 夢
th: ความฝัน

source: none/nothing
ja: 無／何もない
th: ไม่มี/ไม่มีอะไร

source: name
ja: 名前
th: ชื่อ

source: bright
ja: 明るい
th: สว่าง

source: alliance
ja: 同盟
th: พันธมิตร

source: also
ja: また
th: เช่นกัน

source: night
ja: 夜
th: กลางคืน

source: extensive
ja: 広い
th: กว้างขวาง

source: arrow
ja: 矢
th: ลูกศร

source: willow tree
ja: 柳
th: ต้นหลิว

source: only
ja: のみ
th: เท่านั้น

source: gentle/superior
ja: 優しい／優秀
th: อ่อนโยน/ยอดเยี่ยม

source: exist/has
ja: 存在／ある
th: มีอยู่/มี

source: hero/male
ja: 英雄／男性
th: วีรบุรุษ/ชาย

source: evening
ja: 夕方
th: ตอนเย็น

source: leaf
ja: 葉
th: ใบไม้

source: important
ja: 重要な
th: สำคัญ

source: net/silk
ja: 網／糸
th: ตาข่าย/ไหม

source: come
ja: 来る
th: มา

source: scientific name for a kind of grass
ja: 草の一種の学名
th: ชื่อวิทยาศาสตร์ของหญ้าชนิดหนึ่ง

source: indigo
ja: 藍
th: สีคราม

source: orchid
ja: 蘭
th: กล้วยไม้

source: look/view
ja: 見る
th: ดู/มอง

source: benefit
ja: 利益
th: ประโยชน์

source: official
ja: 公式／役人
th: ทางการ

source: plum
ja: 梅
th: ลูกพลัม

source: pear
ja: 梨
th: ลูกแพร์

source: reason
ja: 理由
th: เหตุผล

source: beautiful gem
ja: 美しい宝石
th: อัญมณีที่งดงาม

source: separate
ja: 分ける
th: แยก

source: land
ja: 土地
th: แผ่นดิน

source: law
ja: 法律
th: กฎหมาย

source: flow
ja: 流れ
th: ไหล

source: lapis lazuli
ja: 瑠璃
th: ลาพิส ลาซูลี

source: stay
ja: 滞在
th: พัก

source: dragon
ja: 龍
th: มังกร

source: good
ja: 良い
th: ดี

source: ethics
ja: 倫理
th: จริยธรรม

source: thousandth
ja: 千分の一
th: หนึ่งในพัน

source: forest
ja: 森
th: ป่า

source: face (toward)
ja: 向く
th: หันหน้า (สู่)

source: ring/wheel
ja: 輪／車輪
th: วงแหวน/ล้อ

source: beautiful gem/lapis lazuli
ja: 美しい宝石／瑠璃
th: อัญมณีที่สวยงาม/ลาพิส ลาซูลี

source: good/command
ja: 良い／命令
th: ดี/คำสั่ง

source: actor/clever
ja: 俳優／賢い
th: นักแสดง/ฉลาด

source: example
ja: 例
th: ตัวอย่าง

source: encourage
ja: 励ます
th: ให้กำลังใจ

source: clear gem
ja: 澄んだ宝石
th: อัญมณีใส

source: thanks/etiquette
ja: 礼
th: ขอบคุณ/มารยาท

source: bell
ja: 鈴
th: ระฆัง

source: zero
ja: ゼロ
th: ศูนย์

source: history
ja: 歴史
th: ประวัติศาสตร์

source: row
ja: 列
th: แถว

source: connect
ja: つなぐ
th: เชื่อมต่อ

source: road
ja: 道
th: ถนน

source: dew
ja: 露
th: น้ำค้าง

source: labor
ja: 労働
th: แรงงาน

source: cheerful/bright
ja: 明るい／陽気
th: ร่าเริง/แจ่มใส

source: tower
ja: 塔
th: หอคอย

source: harmony
ja: 調和
th: ความกลมเกลียว

source: Asia/second (variant)
ja: 亜／第二（変種）
th: เอเชีย/ที่สอง (แบบอื่น)

source: dignified
ja: 威厳のある
th: มีศักดิ์ศรี

source: longevity (old style)
ja: 長寿（古式）
th: อายุยืน (แบบโบราณ)

source: charming
ja: 魅力的
th: มีเสน่ห์

source: flat/simple
ja: 平ら／簡素
th: แบน/เรียบง่าย

source: bright/light
ja: 明るい／光
th: สดใส/แสง

source: amber
ja: 琥珀
th: อำพัน

source: truth (old style)
ja: 真実（古式）
th: ความจริง (แบบดั้งเดิม)

source: thanks/etiquette (old style)
ja: 礼（古式）
th: ขอบคุณ/มารยาท (แบบเก่า)

source: jasmine
ja: ジャスミン
th: มะลิ

source: rose
ja: バラ
th: กุหลาบ

source: robust
ja: 頑丈
th: แข็งแรง

source: black
ja: 黒
th: ดำ
